# POSTTEST 2
## DATASET DAN EDA

### Nomor 1

In [85]:
import pandas as pd

#### Read Data

In [86]:
df = pd.read_csv("data/data.csv")

#### Jumlah Record

In [83]:
jumlah_record =len(df)
jumlah_record

70948

#### Nama Atribut

In [87]:
atr = df.columns
df.columns

Index(['title', 'description', 'rating', 'year', 'tags', 'cover'], dtype='object')

#### Jumlah Atribut dengan tipe objek

In [88]:
atr_obj = len(df.select_dtypes(include=["object"]).columns)
atr_obj

4

#### Jumlah Atribut dengan tipe angka

In [89]:
atr_ang = len(df.select_dtypes(include=["float64"]).columns)
atr_ang

2

#### Jumlah Atribut yang memiliki nilai null

In [91]:
atr_null = len(df.isnull().columns)
atr_null

6



### Nomor 2

#### Memasukkan informasi data ke dalam dictionary sesuai dengan nama informasinya

In [92]:
dictionary = {
    "Jumlah Record" : jumlah_record,
    "Nama Atribut"  : atr,
    "Jumlah Atribut dengan tipe objek" : atr_obj,
    "Jumlah atribut dengan tipe angka" : atr_ang,
    "Jumlah atribut yang memiliki nilai null" : atr_null,
}
pd.Series(dictionary)

Jumlah Record                                                                          70948
Nama Atribut                               Index(['title', 'description', 'rating', 'year...
Jumlah Atribut dengan tipe objek                                                           4
Jumlah atribut dengan tipe angka                                                           2
Jumlah atribut yang memiliki nilai null                                                    6
dtype: object



### Nomor 3

#### Menampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum,Q1,Q2 dan Q3 dari atribute bertipe angka

In [93]:
df.describe()

             rating          year
count  29871.000000  70124.000000
mean       3.784694   2011.789302
std        0.400387      9.026567
min        2.000000   1926.000000
25%        3.500000   2008.000000
50%        3.800000   2014.000000
75%        4.100000   2018.000000
max        4.700000   2022.000000



### Nomor 4

#### Menampilkan Nilai Kolerasi attribute bertipe angka

In [94]:
df.corr()

          rating      year
rating  1.000000  0.235943
year    0.235943  1.000000



### Nomor 5

#### Merubah Salah Satu attribute angka menjadi desimal 3 angka

In [95]:
atr_3decimal = df["rating"].map("{:.3f}".format)
atr_3decimal

0        4.700
1        4.700
2        4.700
3        4.700
4        4.700
         ...
70943      nan
70944      nan
70945      nan
70946      nan
70947      nan
Name: rating, Length: 70948, dtype: object

#### Merubah Salah Satu Attribute Angka menjadi Bilangan Bulat

In [96]:
atr_int =df["rating"].map("{:.0f}".format)
atr_int

0          5
1          5
2          5
3          5
4          5
        ...
70943    nan
70944    nan
70945    nan
70946    nan
70947    nan
Name: rating, Length: 70948, dtype: object


### Nomor 6
#### Menampilkan 10 record pertama bertipe angka

In [97]:
df_atr_angka = df.select_dtypes(include=["float64"])
df_atr_angka.head(10)

   rating    year
0     4.7  2021.0
1     4.7  2017.0
2     4.7  2004.0
3     4.7  2019.0
4     4.7  2016.0
5     4.7  2015.0
6     4.7  2017.0
7     4.7  2016.0
8     4.7  2018.0
9     4.7  2020.0



### Nomor 7
#### Menyimpan dataset bertipe angka ke dalam CSV

In [ ]:
df_atr_angka.to_csv("data/Manga,Manhua,Manhwa angka.csv",index=False)